Documents/ЗаписьЖРОИГП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ЗаписьЖРОИГП</Name>
			<BasedOn>
				<xr:Item>Document.ОтчетПроизводстваЗаСмену</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Технолог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВетВрач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кладовщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетПроизводства</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТМЦ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кво</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВНВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВНК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>З</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>К</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>В</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>С</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СредТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СредВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СредК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СредО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаписьЖРОИГП/Forms/ФормаДокументаУФ/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

// При создании формы на сервере - инициализация
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	МассивОценок.Добавить().Значение = "ВН";
	МассивОценок.Добавить().Значение = "Ц";
	МассивОценок.Добавить().Значение = "З";
	МассивОценок.Добавить().Значение = "К";
	МассивОценок.Добавить().Значение = "В";
	МассивОценок.Добавить().Значение = "С";

	// Заполнение значений по умолчанию для нового документа
	Если Объект.Ссылка.Пустая() Тогда
		ЗаполнитьПоУмолчаниюШапку();
	КонецЕсли; // Если новый документ // + claude

КонецПроцедуры // ПриСозданииНаСервере // + claude

// После записи документа - сохранить последние значения шапки
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ХранилищеОбщихНастроек.Сохранить("ЖРОИГПНастройки", "Технолог",  ТекущийОбъект.Технолог);
	ХранилищеОбщихНастроек.Сохранить("ЖРОИГПНастройки", "Кладовщик", ТекущийОбъект.Кладовщик);
	ХранилищеОбщихНастроек.Сохранить("ЖРОИГПНастройки", "ВетВрач",   ТекущийОбъект.ВетВрач);

КонецПроцедуры // ПослеЗаписиНаСервере // + claude

#КонецОбласти // ОбработчикиСобытийФормы // + claude

#Область СлужебныеПроцедурыИФункции

// Заполнение шапки документа сохраненными значениями по умолчанию
&НаСервере
Процедура ЗаполнитьПоУмолчаниюШапку()

	Объект.Технолог  = ХранилищеОбщихНастроек.Загрузить("ЖРОИГПНастройки", "Технолог");
	Объект.Кладовщик = ХранилищеОбщихНастроек.Загрузить("ЖРОИГПНастройки", "Кладовщик");
	Объект.ВетВрач   = ХранилищеОбщихНастроек.Загрузить("ЖРОИГПНастройки", "ВетВрач");

КонецПроцедуры // ЗаполнитьПоУмолчаниюШапку // + claude

// Расчет средних оценок по строке ТЧ (все три ответственных + общая)
&НаКлиенте
Процедура РассчитатьСредниеПоСтроке(СтрокаТЧ)

	Если СтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли; // Если нет строки // + claude

	РассчитатьСреднееПоОтветственному(СтрокаТЧ, "");
	РассчитатьСреднееПоОтветственному(СтрокаТЧ, "В");
	РассчитатьСреднееПоОтветственному(СтрокаТЧ, "К");

КонецПроцедуры // РассчитатьСредниеПоСтроке // + claude

// Расчет среднего значения по конкретному ответственному (Суффикс: "" - технолог, "В" - вет.врач, "К" - кладовщик)
// и общей средней по строке ТЧ // + claude
&НаКлиенте
Процедура РассчитатьСреднееПоОтветственному(СтрокаТЧ, Суффикс)

	Сумма = 0;
	Для Каждого ИмяРекв Из МассивОценок Цикл
		Сумма = Сумма + СтрокаТЧ[ИмяРекв.Значение + Суффикс];
	КонецЦикла; // Для Каждого ИмяРекв // + claude

	СтрокаТЧ["Сред" + ?(Суффикс = "", "Т", Суффикс)] = Окр(Сумма / МассивОценок.Количество(), 1);
	СтрокаТЧ.СредО = Окр((СтрокаТЧ.СредТ + СтрокаТЧ.СредВ + СтрокаТЧ.СредК) / 3, 1);

КонецПроцедуры // РассчитатьСреднееПоОтветственному // + claude

// Установка оценок по строке ТЧ
&НаКлиенте
Процедура УстановитьОценкиПоСтроке(СтрокаТЧ, Тех = Истина, ВетВ = Истина, Клад = Истина, Оценка)

	Для Каждого ИмяРекв Из МассивОценок Цикл
		Если Тех Тогда
			СтрокаТЧ[ИмяРекв.Значение]         = Оценка;
		КонецЕсли; // Если Тех // + claude
		Если ВетВ Тогда
			СтрокаТЧ[ИмяРекв.Значение + "В"]   = Оценка;
		КонецЕсли; // Если ВетВ // + claude
		Если Клад Тогда
			СтрокаТЧ[ИмяРекв.Значение + "К"]   = Оценка;
		КонецЕсли; // Если Клад // + claude
	КонецЦикла; // Для Каждого ИмяРекв // + claude

	РассчитатьСредниеПоСтроке(СтрокаТЧ);

КонецПроцедуры // УстановитьОценкиПоСтроке // + claude

#КонецОбласти // СлужебныеПроцедурыИФункции // + claude

#Область ОбработчикиЭлементовФормы

// Изменение любой оценки технолога в строке - пересчитать среднее технолога и общее // + claude
&НаКлиенте
Процедура ОценкаТехнологПриИзменении(Элемент)

	Если Элементы.ТМЦ.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; // Если нет текущей строки // + claude

	РассчитатьСреднееПоОтветственному(Элементы.ТМЦ.ТекущиеДанные, "");

КонецПроцедуры // ОценкаТехнологПриИзменении // + claude

// Изменение любой оценки вет. врача в строке - пересчитать среднее вет. врача и общее // + claude
&НаКлиенте
Процедура ОценкаВетврачПриИзменении(Элемент)

	Если Элементы.ТМЦ.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; // Если нет текущей строки // + claude

	РассчитатьСреднееПоОтветственному(Элементы.ТМЦ.ТекущиеДанные, "В");

КонецПроцедуры // ОценкаВетврачПриИзменении // + claude

// Изменение любой оценки кладовщика в строке - пересчитать среднее кладовщика и общее // + claude
&НаКлиенте
Процедура ОценкаКладовщикПриИзменении(Элемент)

	Если Элементы.ТМЦ.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; // Если нет текущей строки // + claude

	РассчитатьСреднееПоОтветственному(Элементы.ТМЦ.ТекущиеДанные, "К");

КонецПроцедуры // ОценкаКладовщикПриИзменении // + claude

// При окончании редактирования строки ТЧ - пересчитать средние
&НаКлиенте
Процедура ТМЦПослеОкончанияРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли; // Если отмена // + claude

	РассчитатьСредниеПоСтроке(Элементы.ТМЦ.ТекущиеДанные);

КонецПроцедуры // ТМЦПослеОкончанияРедактирования // + claude

#КонецОбласти // ОбработчикиЭлементовФормы // + claude

#Область КомандыФормы

// Заполнить все оценки по 5 (технолог + ветврач + кладовщик) // + claude
&НаКлиенте
Процедура КомандаЗаполнитьВсеПо5(Команда)
	ЗаполнитьОценки(Истина, Истина, Истина);
КонецПроцедуры // КомандаЗаполнитьВсеПо5 // + claude

// Заполнить оценки по 5 только для технолога // + claude
&НаКлиенте
Процедура КомандаЗаполнитьТехнолог(Команда)
	ЗаполнитьОценки(Истина, Ложь, Ложь);
КонецПроцедуры // КомандаЗаполнитьТехнолог // + claude

// Заполнить оценки по 5 только для ветврача // + claude
&НаКлиенте
Процедура КомандаЗаполнитьВетврач(Команда)
	ЗаполнитьОценки(Ложь, Истина, Ложь);
КонецПроцедуры // КомандаЗаполнитьВетврач // + claude

// Заполнить оценки по 5 только для кладовщика // + claude
&НаКлиенте
Процедура КомандаЗаполнитьКладовщик(Команда)
	ЗаполнитьОценки(Ложь, Ложь, Истина);
КонецПроцедуры // КомандаЗаполнитьКладовщик // + claude

// Заполнить все оценки по 0 (технолог + ветврач + кладовщик)
&НаКлиенте
Процедура КомандаОчистить(Команда)
	ЗаполнитьОценки(Истина, Истина, Истина, 0);
КонецПроцедуры

// Вспомогательная: заполняет оценки 5 по флагам ответственных // + claude
&НаКлиенте
Процедура ЗаполнитьОценки(Тех, ВетВ, Клад, Оценка = 5)
	Для Каждого Строка Из Объект.ТМЦ Цикл
		УстановитьОценкиПоСтроке(Строка, Тех, ВетВ, Клад, Оценка);
	КонецЦикла; // Для Каждого Строка // + claude
КонецПроцедуры // ЗаполнитьОценки // + claude

#КонецОбласти // КомандыФормы // + claude
